
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

46-user Stata network perpetual license:
       Serial number:  401506202372
         Licensed to:  Diarmuid McDonnell
                       University of Birmingham

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  Maximum number of variables is set to 5000; see help set_maxvar.


running C:\Program Files (x86)\Stata15\profile.do ...
Running Diarmuid McDonnell's Stata Profile 1 
15:27:01 25 Aug 2018
C:\Users\mcdonndz-local\Desktop\github\repire_charity_data\logs
  <dir>   8/25/18 15:24  .                 
  <dir>   8/25/18 15:24  ..                
   0.0k   8/25/18 15:27  repire_dataanalysis.log
5971.3k   8/25/18 15:27  repire_datacleaning.log
--------------------------------------------------------------------------------
    Interface settings
      set dockable         on
      set dockingguides    on
      set floatwindows     off
      set locksplitters    off
      set pinnable         on
      set doublebuffer     on
      --------------------------------------------------------------------------
      set linegap          1          pixels
      set scrollbufsize    2048000    characters
      set fastscroll       on
      set reventries       5000       lines
      --------------------------------------------------------------------------
      set maxdb            50         dialog boxes

. do C:/Users/mcdonndz-local/Desktop/github/repire_charity_data/syntax/stata/rep
> ire_dataanalysis.do 20180825 

. // File: benefacts_das.do
. // Creator: Diarmuid McDonnell
. // Created: 27/02/2018
. // Updated: recorded in Github file history
. // Repository: https://github.com/DiarmuidM/benefacts_nonprofit_data_ireland
. 
. ******* Republic of Ireland Charity Data - Data Analysis *******
. 
. /* 
>         This do file performs the following tasks:
>                 - opens clean dataset from the most recent download from Benef
> acts
>                 - performs some basic analyses
>                 - saves these analyses as graphs
>                 
>         The analyses should focus on:
>                 - number and types of charities operating in Ireland
>                 - latest financial profile of organisations
>                 - summary statistics for longitudinal data
> */
. 
. /* Define paths to the data and syntax */
. 
. global projpath "C:\Users\mcdonndz-local\Desktop\github\repire_charity_data"

. global datapath "C:\Users\mcdonndz-local\Desktop\data\repire_charity_data"

. 
. global dofiles "$projpath\syntax\"

. global figures "$projpath\figures\"

. global findings "$projpath\findings\"

. 
. global rawdata "$datapath\data_raw\"

. global cleandata "$datapath\data_clean\" 

. global workingdata "$datapath\data_working\" 

. 
. di "$projpath"
C:\Users\mcdonndz-local\Desktop\github\repire_charity_data

. di "$dofiles"
C:\Users\mcdonndz-local\Desktop\github\repire_charity_data\syntax\

. di "$rawdata"
C:\Users\mcdonndz-local\Desktop\data\repire_charity_data\data_raw\

. di "$cleandata"
C:\Users\mcdonndz-local\Desktop\data\repire_charity_data\data_clean\

. di "$workingdata"
C:\Users\mcdonndz-local\Desktop\data\repire_charity_data\data_working\

. di "$figures"
C:\Users\mcdonndz-local\Desktop\github\repire_charity_data\figures\

. di "$findings"
C:\Users\mcdonndz-local\Desktop\github\repire_charity_data\findings\

. 
. 
. // Take download date from 1st argument of 'dostata' function in repire_master
> .py, and use it to name files.
. 
. global ddate `1'

. di "$ddate"
20180825

. 
. 
. /* Open the clean datasets */
. 
. // Registered charities
. 
. use $cleandata\$ddate\registeredcharities_$ddate.dta, clear
file
    C:\Users\mcdonndz-local\Desktop\data\repire_charity_data\data_clean\201808
    > 25\registeredcharities_20180825.dta not found
r(601);

end of do-file
r(601);
